{
    "mongo":
    {
      "connectionString": "mongodb://localhost:27017/firo"
    },
    "discord_bot":
    {
      "bot_token":"your_discord_bot_token_goes_here"
    },
    "dictionary": {
       "welcome": "Welcome to the Firo Tip Bot\nYour new wallet address is: *%s*. Please check !help for the full list of commands.",
       "balance": "You have %s **Firo** in your wallet! To get tipping check out the commands at !help",
       "incorrect_parameters": "Remember, I'm just a bot. I don't quite understand what you want me to do, so take a look at the !help section and get tipping",
       "incorrect_withdraw": "Please, use `!withdraw [Firo address] [amount]` to withdraw Firo to another wallet address.",
       "deposit": "Here is your Firo Tip Bot address: `%s` Send some Firo here to get tipping.",
       "help": "**Welcome to Firo Tip Bot!**\n\n**My job is:**\n▲ To provide all the information you could possibly need relating to Firo\n▲ I'm also able to help you get tipping other valuable Firoers\n\nBelow is a list of commands that you can send to me, or to groups I'm in:\n \n**Commands for tipping with Firo Tip Bot:**\n- In channels with Firo Tip Bot:\n \n• send a tip to any user: !tip @[username] [amount]\n \n• send a tip to specific user by replying to his/her message with !tip [amount]\n\n- **Direct messaging to Firo Tip Bot**:\n \n• send a !tip @[username] [amount] to any user\n \n• send an anonymous tip with !atip @[username] [amount]\n \n• check your !balance anytime\n \n• see the !deposit address for your Telegram-bound wallet\n \n• transfer your funds to a more secure wallet !withdraw [FiroAddress] [amount]\n\n**WARNING: **\n- Firo Tip Bot is an experimental module, do not store large amounts in it!\n- Your funds are stored in a personal address, not in a personal wallet! It means, you can't have access the seed phrase or the wallet database.\n- We take no responsibility for any lost or stolen funds. By using Firo Tip Bot Bot, you fully accept the risk.\nTo keep your Firo safe, we recommend using Firo desktop and mobile wallets.\n\n**For Fun**:\n• !envelope [amount] - sends a red envelope to the group, where everyone can open and share the Firo\n\n",
       "tip_help": "**Below are the commands for tipping with Firo Tip Bot**:\n\n**In channels with Firo Tip Bot**: \n- Reply to a message with !tip [amount] to send that user a tip\n- Or send them a tip outside of a reply with !tip @[username] [amount]\n\n**Direct messaging Firo Tip Bot**: \n- You can also send a !tip @[username] [amount] from here\n- Or you can send one anonymously with !atip @[username] [amount]\n- Check your !balance at anytime to see how many Firo you have\n- You can see your !deposit address, and send it some Firo for tipping\n- At any time you can !withdraw [FiroAddress] [amount] to a more secure wallet\n\n**WARNING**: Firo Tip Bot is experimental, do not store large sums in your address! Your Firo are stored in your personal address, not a personal wallet. For this reason there are no back up options for your wallet address. We take no responsibility for lost or stolen funds. By using Firo Tip Bot Tip Bot, you accept the risk.",
       "withdrawal_result": "**You withdrew %s Firo to**: `%s` ",
       "incorrect_balance": "**You don't have enough Firo to send this transaction!**\n**Your balance is: %s Firo**",
       "incorrect_amount": "Something isn't quite right with this command. Please check !help for the full list of commands.",
       "username_error": "This username has not started using Firo Tip Bot! Please tell the user to message the bot with !start to get an address and get tipping",
       "tip_received": "You received a %s **Firo tip** from %s. You must be doing something right!",
       "tip_sent": "You sent a tip of **%s** Firos to %s",
       "withdrawal_busy": "You have unconfirmed withdrawal. Please, wait for confirmations.",
       "withdrawal_failed": "**Withdrawal failed. Try again in one minute...**"
    },
    "httpprovider": "http://username:password@localhost:8888",
    "log_ch": "tipbot_logs",
     "discord_server": "discord_server_name",
    "admins": {
      "yourdiscordname": true
    }
}
